Tutorials-3.0.1/case-subsonic/Aco-1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(tauMC)      Gauss linear;
    div((-devRhoReff&U)) Gauss linear;
    div((muEff*dev2(T(grad(U))))) Gauss linear;
    
    //momentum equation
    div(phi_nei,U)	Gauss vanLeer;
    div(phi_own,U)	Gauss vanLeer;

    //energy equation
    div(phi_nei,h)	Gauss vanLeer;
    div(phi_own,h)	Gauss vanLeer;
    div(phi_nei,K)	Gauss vanLeer;
    div(phi_own,K)	Gauss vanLeer;

    //continuity equation
    div(phid_nei,p)	Gauss vanLeer;
    div(phid_own,p)	Gauss vanLeer;
    
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         none;
    
    interpolate((rho*U))	linear;
    
    reconstruct(psi)		vanLeer;
    reconstruct(p)		vanLeer;
    reconstruct(U)		vanLeer;
    reconstruct(Dp)		vanLeer;
    reconstruct(rho)            vanLeer;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default	none;
    p;
}

// ************************************************************************* //
